N1 = int(input("Поворот локатора 1: (1 - направо (90 градусов), -1 - налево (-90 градусов), 2 - в обратную сторону(180 градусов) = "))
N2 = int(input("Поворот локатора 2: (1 - направо (90 градусов), -1 - налево (-90 градусов), 2 - в обратную сторону(180 градусов) = "))
if ((N1 == 1) and (N2 == -1)) or ((N1 == 2) and (N2 == 2))or((N1 == -1) and (N2 == 1)):
    print('север')
elif ((N1 == -1) and (N2 == 2)) or((N1 == 2) and (N2 == -1)):
    print('восток')
elif ((N1 == 1) and (N2 == 1)) or ((N1 == -1) and (N2 == -1)):
    print('юг')
elif ((N1 == 1) and (N2 == 2))  or ((N1 == 2) and (N2 == 1)):
    print('запад')



    
